Белгипрозем_2017/src/InformationRegisters/ОбменСМобильнымиНастройкиПользователей/ОбменСМобильнымиНастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбменСМобильнымиНастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>EnumRef.ОбменСМобильнымиТипыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/ОбменСМобильнымиТипыНастроекПользователей/ОбменСМобильнымиТипыНастроекПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбменСМобильнымиТипыНастроекПользователей</name>
  <enumValues>
    <name>МаксимальныйРазмерФайлов</name>
  </enumValues>
  <enumValues>
    <name>ОграничениеФорматовПередаваемыхФайлов</name>
  </enumValues>
  <enumValues>
    <name>ПериодПервичнойЗагрузки</name>
  </enumValues>
  <enumValues>
    <name>ПодробныйПротоколОбменаСМобильнымУстройством</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияЗадач</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияКалендаря</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияКонтроля</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияПочты</name>
  </enumValues>
  <enumValues>
    <name>СрокУстареванияДанных</name>
  </enumValues>
  <enumValues>
    <name>ФорматыПередаваемыхФайлов</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьPushУведомления</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/InformationRegisters/ОбменСМобильнымиНастройкиПользователей/ManagerModule.bsl
// Записывает персональную настройку синхронизации с мобильными клиентами
// Параметры:
//	Пользователь - ссылка на пользователя
//	ТипНастройки - ссылка на перечисление ОбменСМобильнымиТипыНастроекПользователей
//	Значение - значение настройки
Процедура ЗаписатьНастройку(Пользователь, ТипНастройки, Значение) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Настройка = ТипНастройки;
	МенеджерЗаписи.Значение = Значение;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Возвращает персональную настройку синхронизации с мобильными клиентами.
// Если настройка ранее не выполнялась, то возвращается значение по умолчанию.
// Параметры:
//	Пользователь - ссылка на пользователя
//	ТипНастройки - ссылка на перечисление ОбменСМобильнымиТипыНастроекПользователей
Функция ПолучитьНастройку(Пользователь, ТипНастройки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Настройка = ТипНастройки;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Пользователь = Пользователь;
		МенеджерЗаписи.Настройка = ТипНастройки;
		
		Если ТипНастройки = Перечисления.ОбменСМобильнымиТипыНастроекПользователей.МаксимальныйРазмерФайлов Тогда
			МенеджерЗаписи.Значение = 512;
		ИначеЕсли ТипНастройки = Перечисления.ОбменСМобильнымиТипыНастроекПользователей.ПериодПервичнойЗагрузки Тогда
			МенеджерЗаписи.Значение = 7;
		ИначеЕсли ТипНастройки = Перечисления.ОбменСМобильнымиТипыНастроекПользователей.СинхронизацияЗадач Тогда
			МенеджерЗаписи.Значение = Истина;
		ИначеЕсли ТипНастройки = Перечисления.ОбменСМобильнымиТипыНастроекПользователей.СинхронизацияКалендаря Тогда
			МенеджерЗаписи.Значение = Истина;
		ИначеЕсли ТипНастройки = Перечисления.ОбменСМобильнымиТипыНастроекПользователей.СинхронизацияПочты Тогда
			МенеджерЗаписи.Значение = Истина;
		ИначеЕсли ТипНастройки = Перечисления.ОбменСМобильнымиТипыНастроекПользователей.СрокУстареванияДанных Тогда
			МенеджерЗаписи.Значение = 14;
		КонецЕсли;
		
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	Возврат МенеджерЗаписи.Значение;
	
КонецФункции
